Revit 2027 API
ParameterTypeId.WallLocationLineOffsetParam Property
 "Location Line Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallLocationLineOffsetParam { get; }
Public Shared ReadOnly Property WallLocationLineOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallLocationLineOffsetParam {
	ForgeTypeId^ get ();
}
static member WallLocationLineOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace